<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"b41b000963f474b347159bed31c07afc109c54bc565fd516fe7fb980564ffb44","plan_job_ref":"Job Plan Airflow DAGs #175 at https://github.com/cal-itp/data-infra/actions/runs/16057748977","plan_out_hash":"1ebbba16e5aaf24d09233ba085000afa2f0354811b83b003fb16e76b1687c557","plan_hash":"931dd41c3a391e8b12c351e782b519675d6ef1fccd802a19988f015e363f673e","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/pod_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "tj5eaw==" -> (known after apply)
!~      detect_md5hash      = "OUt+5FEzBToJsY29MClGeg==" -> "different hash"
!~      generation          = 1749663110737169 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/pod_operator.py"
!~      md5hash             = "OUt+5FEzBToJsY29MClGeg==" -> (known after apply)
        name                = "plugins/operators/pod_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-partial_parse" {
        id                  = "calitp-staging-composer-data/warehouse/target/partial_parse.msgpack"
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (21 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #175](https://github.com/cal-itp/data-infra/actions/runs/16057748977)